[
  {
    "id": "6072588f-76e1-44db-9013-ece50994502b",
    "type_local": "Full Time",
    "url": "https://localhost/positions/6072588f-76e1-44db-9013-ece50994502b",
    "created_at": "Thu May 14 10:13:06 UTC 2020",
    "company_local": "Coolblue",
    "company_url": "http://careersatcoolblue.com",
    "location": "Rotterdam, The Netherlands",
    "title_local": "Senior Software Engineer",
    "description": "<p><strong>Coolblue - Anything for a smile</strong></p>\n<p>One of the fastest growing e-commerce companies in the Netherlands and Belgium.</p>\n<p><strong>Position</strong></p>\n<p>You'll build modern applications for Coolblue back’s office. We have a lot of friends, and they crave well-structured data and user-friendly, task-focused applications. You regularly participate in brainstorm sessions about user experience, data, and task flow with the UX Designer, Product Owner, and Data Scientists in your team. Besides that you will create disconnected, highly congruent, and testable code that can easily be maintained and is future-proof.</p>\n<p><strong>You enjoy doing this</strong></p>\n<ul>\n<li>Working with various types of data stores, such as Oracle or Dynamo/Cosmos.</li>\n<li>Solving problems by using accepted best practices and principles, such as TDD/BDD, SOLID, and design patterns.</li>\n<li>Learning from your senior Developers.</li>\n<li>Recording sprint demo’s.</li>\n<li>Creating pull requests in the application GitHub repo.</li>\n<li>Working on Git (and Github) and running tests in TeamCity.</li>\n</ul>\n<p><strong>You recognize yourself in the following</strong></p>\n<ul>\n<li>You have between 3-5 years of experience as a C# Developer.</li>\n<li>You have experience with software architecture and building .NET applications.</li>\n<li>You have experience with Web API or MVC in .NET Core.</li>\n<li>Working with Scrum/Agile working is second nature to you.</li>\n<li>Having experience with front-end development (React), Javascript, HTML5, and CSS is a plus.</li>\n</ul>\n<p><strong>This is what you’re looking for in a job</strong></p>\n<ul>\n<li>Money.</li>\n<li>Travel allowance and a retirement plan.</li>\n<li>Relocation assistance: from A to Z (we only hire people with an European passport).</li>\n<li>25 leave days. As long as you promise to come back.</li>\n<li>A discount on all our products.</li>\n<li>A picture-perfect office at a great location. You could crawl to work from Rotterdam Central Station. Though we recommend just walking for 2 minutes.</li>\n<li>An extraordinarily good work environment, with freshly made snacks, monthly drinks, <a href=\"https://www.youtube.com/watch?v=quaJO8bi-0I&amp;feature=youtu.be\">legendary Coolblue parties</a>, <a href=\"https://www.youtube.com/watch?v=_50_ELxnGNk\">awesome team activities</a>, and an informal, playful department.</li>\n<li>Working together in an international environment with colleagues from the Netherlands, Belgium, Spain, Brazil, Mexico, and Italy, among others.</li>\n<li>Room for new initiatives and ideas. We’re always open to those, whether you’ve been with us for a week, a month, or a year.</li>\n</ul>\n<p><strong>Development at Coolblue</strong></p>\n<p>Over time we have learned that being successful as a company is not possible without smart IT. Our developers have one thing in common: they work hard to deliver value to our customers.\nAt Coolblue we don’t outsource our solutions if they provide us with a competitive advantage. Therefore, we keep all of our important processes in-house, and when you work for us, you’ll have the opportunity to personally make our logistics, our stores, our web shops and our financial processes even better.\nWe work in Scrum teams to ensure constant feedback and improvement and we aim to deliver new improvements daily.</p>\n<p><strong>What our developers love at Coolblue</strong></p>\n<ul>\n<li>Besides their own specialization they make fast progress in becoming all-round developers.</li>\n<li>Defining their own priorities and directly receiving feedback from users.</li>\n<li>There is room to experiment.</li>\n<li>Using the right tool for the job.</li>\n<li>The fact that we always have budget available for great ideas.</li>\n</ul>\n<p>Like what you see? You can become a Coolbluer, <a href=\"https://www.careersatcoolblue.com/vacancies/c-developer/?utm_source=Github&amp;utm_medium=jobboard&amp;utm_campaign=Github_C\">apply now</a>!</p>\n",
    "how_to_apply": "<p>Like what you see? You can become a Coolbluer, <a href=\"https://www.careersatcoolblue.com/vacancies/c-developer/?utm_source=Github&amp;utm_medium=jobboard&amp;utm_campaign=Github_C\">apply now</a>!</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa3FEIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--552356f7578f2e1177388c4b0df135242d29640b/Coolblue%20logo.jpg"
  },
  {
    "id": "1fb55c33-9a44-49ad-82db-7aabf67559fe",
    "type_local": "Full Time",
    "url": "https://localhost/positions/1fb55c33-9a44-49ad-82db-7aabf67559fe",
    "created_at": "Fri May 15 20:17:53 UTC 2020",
    "company_local": "Lendeavor",
    "company_url": "https://www.lendeavor.com/",
    "location": "San Francisco",
    "title_local": "Local Storage Senior Infrastructure Engineer",
    "description": "<p>What we need:</p>\n<p>You are passionate about automation of infrastructure configuration and management and systems security. You are excited about being part of a purpose-driven organization that's helping to reduce the financial burden of healthcare professionals. Building a modern bank requires engineers with expertise in distributed systems architecture, infrastructure as a service, and information security best practices. Lendeavor is looking for an experienced lead infrastructure engineer to be a foundational member of the team.</p>\n<p>What you'll do:</p>\n<p>Manage our AWS and Heroku environments\nImplement best practices for automating configuration management using Terraform and CloudFormation\nSupport our engineering organization through implementation of tooling and best practices for CI/CD using CodePipeline, CodeShip, GitHub\nManage operational needs of our RDBMS system (Postgres), and NOSQL solutions (Redis)\nManage our AWS infrastructure, including components such as S3, ELB, ECS containers, EC2 instances\nWork with engineering and IT to configure systems and network topology to support application development and our IT environment with appropriate security contexts\nMonitor applications and infrastructure for security vulnerabilities to ensure compliance with our SOC-2 Type II requirements\nWork with third party to facilitate annual penetration test and promptly remediate any findings\nWork to continually improve the engineering process through collaboration</p>\n<p>What you have:</p>\n<p>B.S. in computer science or equivalent experience\n5+ years of systems or devops engineering experience\nHigh proficiency with Terraform or equivalent\nHigh proficiency with Linux and bash/shell scripting\nExperience setting up CI/CD pipelines\nPrior operating experience with Docker/ECS/Kubernetes\nPrior operating experience with Postgres and Redis\nPrior operating experience with messaging systems (RabbitMQ, SQS, or equivalent)\nDemonstrated understanding of systems design principles and best practices\nDemonstrated understanding of TCP/IP and networking components\nStrong analytical and technical skills\nStrong written and verbal communication skills\nPrior startup or growth company experience preferred\nPrior fintech or financial services experience preferred</p>\n<p>Lendeavor is seeking candidates for the role in both San Francisco, CA and Columbus, OH.</p>\n",
    "how_to_apply": "<p>Please apply online at <a href=\"https://www.lendeavor.com/careers\">https://www.lendeavor.com/careers</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbVNEIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f71087d56e49ba9ffeb98a2be3476bbfafa98164/Lendeavor_logo_lg.png"
  },
  {
    "id": "5180386d-8397-4245-9908-e9123b21a74c",
    "type_local": "Part Time",
    "url": "https://jobs.github.com/positions/5180386d-8397-4245-9908-e9123b21a74c",
    "created_at": "Fri May 15 13:00:34 UTC 2020",
    "company_local": "Daventry Solutions, LLC",
    "company_url": "http:",
    "location": "Remote",
    "title_local": "Full Stack Web/Javascript Developer",
    "description": "<p>US CITIZENS ONLY</p>\n<p>Contractor position with possible option to come on as an employee after a 90 day period.</p>\n<p>Duration: Approximately 3 months with opiton to come on full time.</p>\n<p>Hours Requirement: 20 hours minimum / 40 hours maximum</p>\n<p>Pay: $85 per hour</p>\n<p>Project Description:</p>\n<ul>\n<li>The client is building a compliance dashboard app for the automation of IT security procedures. The application feeds from the Forescout API (Security/Compliance platform).</li>\n<li>The application gathers vulnerability information and summarizes it using the type of device the vulnerability is on. The application also requires user input/configuration to answer Qualitative questions that are not machine-determinable.</li>\n</ul>\n<p>Technical Info:</p>\n<ul>\n<li>The application is written using Nuxt.JS / Vue.JS and is wrapped in an Electron container for running on a user's desktop.</li>\n<li>It will have a web server component (still to be developed) to maintain historical trends and other data using an Elasticsearch backend</li>\n<li>Staging environment exists.</li>\n</ul>\n<p>Tasks and Deliverables:</p>\n<ul>\n<li>The underpinnings of the app have already been developed, now it is a lot of tweaking, bug fixing, and feature development to meet all the needs.</li>\n</ul>\n<p>Required Skills:</p>\n<ul>\n<li>JavaScript expert - Nuxt.JS or Vue.JS knowledge is a nice to have.</li>\n<li>Document-based data stores (Elasticsearch).</li>\n<li>Be comfortable working with large datasets (1 million+ JSON documents).</li>\n<li>Node.js</li>\n</ul>\n<p>Optional Skills:</p>\n<ul>\n<li>Experience with Forescout’s API</li>\n</ul>\n<p>Stack:</p>\n<ul>\n<li>Frontend: JavaScript - Nuxt.JS and Vue.JS.</li>\n<li>Backend: Node.js</li>\n<li>Storage: Elasticsearch</li>\n<li>Infrastructure: Local server</li>\n<li>APIs: Forescout API, Elasticsearch API</li>\n</ul>\n<p>Engagement Highlights:</p>\n<ul>\n<li>Very interesting product in the IT's Security/Compliance space.</li>\n<li>Opportunity to work with Forescout if you haven't yet!</li>\n</ul>\n",
    "how_to_apply": "<p>Email resume to: <a href=\"mailto:robert@davsol.net\">robert@davsol.net</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbDZEIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--acaa0775b8594628e32e9359a96fd6d77a2a0b3d/Daventry%20Solutions%20Logos%20-%20Red%20Feather2.png"
  }
]